We tried same configuration  we are not able to reproduce
```
Harinis-MacBook-Pro:roka hkantare$ terraform apply
2020/04/17 14:05:44 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2020/04/17 14:05:44 [INFO] Terraform version: 0.12.24  
2020/04/17 14:05:44 [INFO] Go runtime version: go1.12.13
2020/04/17 14:05:44 [INFO] CLI args: []string{"/Users/hkantare/terraform/terraform", "apply"}
2020/04/17 14:05:44 [DEBUG] Attempting to open CLI config file: /Users/hkantare/.terraformrc
2020/04/17 14:05:44 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2020/04/17 14:05:44 [DEBUG] checking for credentials in "/Users/hkantare/.terraform.d/plugins"
2020/04/17 14:05:44 [DEBUG] checking for credentials in "/Users/hkantare/.terraform.d/plugins/darwin_amd64"
2020/04/17 14:05:44 [INFO] CLI command args: []string{"apply"}
2020/04/17 14:05:44 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2020/04/17 14:05:44 [DEBUG] New state was assigned lineage "658b4482-3f2d-e595-bbc3-a50b4d3eb908"
2020/04/17 14:05:44 [DEBUG] checking for provider in "."
2020/04/17 14:05:44 [DEBUG] checking for provider in "/Users/hkantare/terraform"
2020/04/17 14:05:44 [DEBUG] checking for provider in ".terraform/plugins/darwin_amd64"
2020/04/17 14:05:44 [DEBUG] checking for provider in "/Users/hkantare/.terraform.d/plugins"
2020/04/17 14:05:44 [WARN] found legacy provider "terraform-provider-ibm"
2020/04/17 14:05:44 [DEBUG] checking for provider in "/Users/hkantare/.terraform.d/plugins/darwin_amd64"
2020/04/17 14:05:44 [DEBUG] found provider "terraform-provider-ibm_v1.2.6"
2020/04/17 14:05:44 [DEBUG] found valid plugin: "ibm", "0.0.0", "/Users/hkantare/.terraform.d/plugins/terraform-provider-ibm"
2020/04/17 14:05:44 [DEBUG] found valid plugin: "ibm", "1.2.6", "/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6"
2020/04/17 14:05:44 [DEBUG] checking for provisioner in "."
2020/04/17 14:05:44 [DEBUG] checking for provisioner in "/Users/hkantare/terraform"
2020/04/17 14:05:44 [DEBUG] checking for provisioner in ".terraform/plugins/darwin_amd64"
2020/04/17 14:05:44 [DEBUG] checking for provisioner in "/Users/hkantare/.terraform.d/plugins"
2020/04/17 14:05:44 [DEBUG] checking for provisioner in "/Users/hkantare/.terraform.d/plugins/darwin_amd64"
2020/04/17 14:05:44 [INFO] backend/local: starting Apply operation
2020-04-17T14:05:45.666+0530 [INFO]  plugin: configuring client automatic mTLS
2020-04-17T14:05:45.742+0530 [DEBUG] plugin: starting plugin: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6 args=[/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6]
2020-04-17T14:05:45.754+0530 [DEBUG] plugin: plugin started: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6 pid=57646
2020-04-17T14:05:45.756+0530 [DEBUG] plugin: waiting for RPC address: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6
2020-04-17T14:05:45.828+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:05:45 IBM Cloud Provider version 1.3.0  
2020-04-17T14:05:45.833+0530 [INFO]  plugin.terraform-provider-ibm_v1.2.6: configuring server automatic mTLS: timestamp=2020-04-17T14:05:45.832+0530
2020-04-17T14:05:45.919+0530 [DEBUG] plugin: using plugin: version=5
2020-04-17T14:05:45.919+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: plugin address: address=/var/folders/gc/bk1t73kn3qldrktw_9xqm3880000gn/T/plugin890885677 network=unix timestamp=2020-04-17T14:05:45.917+0530
2020-04-17T14:05:46.055+0530 [DEBUG] plugin: plugin process exited: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6 pid=57646
2020-04-17T14:05:46.055+0530 [DEBUG] plugin: plugin exited
2020/04/17 14:05:46 [INFO] terraform: building graph: GraphTypeValidate
2020/04/17 14:05:46 [DEBUG] adding implicit provider configuration provider.ibm, implied first by ibm_container_cluster.RHOS
2020/04/17 14:05:46 [DEBUG] ProviderTransformer: "data.ibm_container_cluster_config.cluster_config" (*terraform.NodeValidatableResource) needs provider.ibm
2020/04/17 14:05:46 [DEBUG] ProviderTransformer: "ibm_container_cluster.RHOS" (*terraform.NodeValidatableResource) needs provider.ibm
2020/04/17 14:05:46 [DEBUG] ProviderTransformer: "data.ibm_resource_group.resource_group" (*terraform.NodeValidatableResource) needs provider.ibm
2020/04/17 14:05:46 [DEBUG] ReferenceTransformer: "ibm_container_cluster.RHOS" references: [data.ibm_resource_group.resource_group]
2020/04/17 14:05:46 [DEBUG] ReferenceTransformer: "data.ibm_resource_group.resource_group" references: []
2020/04/17 14:05:46 [DEBUG] ReferenceTransformer: "data.ibm_container_cluster_config.cluster_config" references: [ibm_container_cluster.RHOS data.ibm_resource_group.resource_group ibm_container_cluster.RHOS]
2020/04/17 14:05:46 [DEBUG] ReferenceTransformer: "provider.ibm" references: []
2020/04/17 14:05:46 [DEBUG] Starting graph walk: walkValidate
2020-04-17T14:05:46.066+0530 [INFO]  plugin: configuring client automatic mTLS
2020-04-17T14:05:46.098+0530 [DEBUG] plugin: starting plugin: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6 args=[/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6]
2020-04-17T14:05:46.112+0530 [DEBUG] plugin: plugin started: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6 pid=57647
2020-04-17T14:05:46.112+0530 [DEBUG] plugin: waiting for RPC address: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6
2020-04-17T14:05:46.169+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:05:46 IBM Cloud Provider version 1.3.0  
2020-04-17T14:05:46.172+0530 [INFO]  plugin.terraform-provider-ibm_v1.2.6: configuring server automatic mTLS: timestamp=2020-04-17T14:05:46.172+0530
2020-04-17T14:05:46.205+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: plugin address: address=/var/folders/gc/bk1t73kn3qldrktw_9xqm3880000gn/T/plugin374044802 network=unix timestamp=2020-04-17T14:05:46.205+0530
2020-04-17T14:05:46.206+0530 [DEBUG] plugin: using plugin: version=5
2020/04/17 14:05:46 [WARN] <root>: eval: *terraform.EvalValidateProvider, non-fatal err: 2 warnings:

- "softlayer_username": [DEPRECATED] This field is deprecated please use iaas_classic_username
- "softlayer_api_key": [DEPRECATED] This field is deprecated please use iaas_classic_api_key
2020/04/17 14:05:46 [WARN] <root>: eval: *terraform.EvalSequence, non-fatal err: 2 warnings:

- "softlayer_username": [DEPRECATED] This field is deprecated please use iaas_classic_username
- "softlayer_api_key": [DEPRECATED] This field is deprecated please use iaas_classic_api_key
2020/04/17 14:05:46 [WARN] <root>: eval: *terraform.EvalOpFilter, non-fatal err: 2 warnings:

- "softlayer_username": [DEPRECATED] This field is deprecated please use iaas_classic_username
- "softlayer_api_key": [DEPRECATED] This field is deprecated please use iaas_classic_api_key
2020/04/17 14:05:46 [WARN] <root>: eval: *terraform.EvalSequence, non-fatal err: 2 warnings:

- "softlayer_username": [DEPRECATED] This field is deprecated please use iaas_classic_username
- "softlayer_api_key": [DEPRECATED] This field is deprecated please use iaas_classic_api_key
2020/04/17 14:05:46 [WARN] provider.ibm: 2 warnings:

- "softlayer_username": [DEPRECATED] This field is deprecated please use iaas_classic_username
- "softlayer_api_key": [DEPRECATED] This field is deprecated please use iaas_classic_api_key
2020-04-17T14:05:46.317+0530 [DEBUG] plugin: plugin process exited: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6 pid=57647
2020-04-17T14:05:46.317+0530 [DEBUG] plugin: plugin exited
2020/04/17 14:05:46 [INFO] backend/local: apply calling Refresh
2020/04/17 14:05:46 [INFO] terraform: building graph: GraphTypeRefresh
2020/04/17 14:05:46 [DEBUG] adding implicit provider configuration provider.ibm, implied first by data.ibm_resource_group.resource_group
2020/04/17 14:05:46 [DEBUG] ProviderTransformer: "data.ibm_resource_group.resource_group" (*terraform.NodeRefreshableDataResource) needs provider.ibm
2020/04/17 14:05:46 [DEBUG] ProviderTransformer: "data.ibm_container_cluster_config.cluster_config" (*terraform.NodeRefreshableDataResource) needs provider.ibm
2020/04/17 14:05:46 [DEBUG] ReferenceTransformer: "provider.ibm" references: []
2020/04/17 14:05:46 [DEBUG] ReferenceTransformer: "data.ibm_resource_group.resource_group" references: []
2020/04/17 14:05:46 [DEBUG] ReferenceTransformer: "data.ibm_container_cluster_config.cluster_config" references: [data.ibm_resource_group.resource_group]
2020/04/17 14:05:46 [DEBUG] Starting graph walk: walkRefresh
2020-04-17T14:05:46.321+0530 [INFO]  plugin: configuring client automatic mTLS
2020-04-17T14:05:46.351+0530 [DEBUG] plugin: starting plugin: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6 args=[/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6]
2020-04-17T14:05:46.365+0530 [DEBUG] plugin: plugin started: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6 pid=57648
2020-04-17T14:05:46.365+0530 [DEBUG] plugin: waiting for RPC address: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6
2020-04-17T14:05:46.434+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:05:46 IBM Cloud Provider version 1.3.0  
2020-04-17T14:05:46.438+0530 [INFO]  plugin.terraform-provider-ibm_v1.2.6: configuring server automatic mTLS: timestamp=2020-04-17T14:05:46.438+0530
2020-04-17T14:05:46.517+0530 [DEBUG] plugin: using plugin: version=5
2020-04-17T14:05:46.517+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: plugin address: address=/var/folders/gc/bk1t73kn3qldrktw_9xqm3880000gn/T/plugin516571695 network=unix timestamp=2020-04-17T14:05:46.516+0530
2020-04-17T14:05:46.640+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:05:46 Configuring SoftLayer Session with API key
2020-04-17T14:05:46.640+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:05:46 Configuring IBM Cloud Session with API key
2020-04-17T14:05:57.526+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:05:57 the apiendpoint url for power is us-south.power-iaas.cloud.ibm.com
2020/04/17 14:05:57 [DEBUG] Resource state not found for node "data.ibm_resource_group.resource_group", instance data.ibm_resource_group.resource_group
2020/04/17 14:05:57 [DEBUG] ReferenceTransformer: "data.ibm_resource_group.resource_group" references: []
data.ibm_resource_group.resource_group: Refreshing state...
2020/04/17 14:06:00 [DEBUG] Resource state not found for node "data.ibm_container_cluster_config.cluster_config", instance data.ibm_container_cluster_config.cluster_config
2020/04/17 14:06:00 [DEBUG] ReferenceTransformer: "data.ibm_container_cluster_config.cluster_config" references: []
2020-04-17T14:06:00.879+0530 [DEBUG] plugin: plugin process exited: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6 pid=57648
2020-04-17T14:06:00.879+0530 [DEBUG] plugin: plugin exited
2020/04/17 14:06:00 [INFO] backend/local: apply calling Plan
2020/04/17 14:06:00 [INFO] terraform: building graph: GraphTypePlan
2020/04/17 14:06:00 [DEBUG] adding implicit provider configuration provider.ibm, implied first by ibm_container_cluster.RHOS
2020/04/17 14:06:00 [DEBUG] ProviderTransformer: "data.ibm_resource_group.resource_group" (*terraform.NodePlannableResource) needs provider.ibm
2020/04/17 14:06:00 [DEBUG] ProviderTransformer: "data.ibm_container_cluster_config.cluster_config" (*terraform.NodePlannableResource) needs provider.ibm
2020/04/17 14:06:00 [DEBUG] ReferenceTransformer: "ibm_container_cluster.RHOS" references: [data.ibm_resource_group.resource_group]
2020/04/17 14:06:00 [DEBUG] ReferenceTransformer: "data.ibm_resource_group.resource_group" references: []
2020/04/17 14:06:00 [DEBUG] ReferenceTransformer: "data.ibm_container_cluster_config.cluster_config" references: [ibm_container_cluster.RHOS data.ibm_resource_group.resource_group ibm_container_cluster.RHOS]
2020/04/17 14:06:00 [DEBUG] ReferenceTransformer: "provider.ibm" references: []
2020/04/17 14:06:00 [DEBUG] Starting graph walk: walkPlan
2020-04-17T14:06:00.885+0530 [INFO]  plugin: configuring client automatic mTLS
2020-04-17T14:06:00.929+0530 [DEBUG] plugin: starting plugin: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6 args=[/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6]
2020-04-17T14:06:00.945+0530 [DEBUG] plugin: plugin started: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6 pid=57649
2020-04-17T14:06:00.946+0530 [DEBUG] plugin: waiting for RPC address: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6
2020-04-17T14:06:01.053+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:06:01 IBM Cloud Provider version 1.3.0  
2020-04-17T14:06:01.059+0530 [INFO]  plugin.terraform-provider-ibm_v1.2.6: configuring server automatic mTLS: timestamp=2020-04-17T14:06:01.059+0530
2020-04-17T14:06:01.120+0530 [DEBUG] plugin: using plugin: version=5
2020-04-17T14:06:01.120+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: plugin address: address=/var/folders/gc/bk1t73kn3qldrktw_9xqm3880000gn/T/plugin477377308 network=unix timestamp=2020-04-17T14:06:01.119+0530
2020-04-17T14:06:01.215+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:06:01 Configuring SoftLayer Session with API key
2020-04-17T14:06:01.215+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:06:01 Configuring IBM Cloud Session with API key
2020-04-17T14:06:09.183+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:06:09 the apiendpoint url for power is us-south.power-iaas.cloud.ibm.com
2020/04/17 14:06:09 [DEBUG] ReferenceTransformer: "data.ibm_resource_group.resource_group" references: []
2020/04/17 14:06:09 [DEBUG] Resource instance state not found for node "ibm_container_cluster.RHOS", instance ibm_container_cluster.RHOS
2020/04/17 14:06:09 [DEBUG] ReferenceTransformer: "ibm_container_cluster.RHOS" references: []
2020/04/17 14:06:09 [WARN] Provider "registry.terraform.io/-/ibm" produced an invalid plan for ibm_container_cluster.RHOS, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .gateway_enabled: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .worker_num: planned value cty.NumberIntVal(0) does not match config value cty.NullVal(cty.Number)
      - .disk_encryption: planned value cty.True does not match config value cty.NullVal(cty.Bool)
      - .wait_time_minutes: planned value cty.NumberIntVal(90) does not match config value cty.NullVal(cty.Number)
      - .update_all_workers: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .workers_info: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2020/04/17 14:06:09 [DEBUG] Resource instance state not found for node "data.ibm_container_cluster_config.cluster_config", instance data.ibm_container_cluster_config.cluster_config
2020/04/17 14:06:09 [DEBUG] ReferenceTransformer: "data.ibm_container_cluster_config.cluster_config" references: []
2020-04-17T14:06:09.212+0530 [DEBUG] plugin: plugin process exited: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6 pid=57649
2020-04-17T14:06:09.213+0530 [DEBUG] plugin: plugin exited

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.ibm_container_cluster_config.cluster_config will be read during apply
  # (config refers to values not yet known)
 <= data "ibm_container_cluster_config" "cluster_config"  {
      + admin_certificate       = (known after apply)
      + admin_key               = (sensitive value)
      + ca_certificate          = (known after apply)
      + calico_config_file_path = (known after apply)
      + cluster_name_id         = (known after apply)
      + config_dir              = "."
      + config_file_path        = (known after apply)
      + host                    = (known after apply)
      + id                      = (known after apply)
      + resource_group_id       = "ebf20540c1bc4ed485d936a4920cb563"
      + token                   = (known after apply)
    }

  # ibm_container_cluster.RHOS will be created
  + resource "ibm_container_cluster" "RHOS" {
      + albs                         = (known after apply)
      + crn                          = (known after apply)
      + datacenter                   = "dal10"
      + default_pool_size            = 1
      + disk_encryption              = true
      + gateway_enabled              = false
      + hardware                     = "shared"
      + id                           = (known after apply)
      + ingress_hostname             = (known after apply)
      + ingress_secret               = (sensitive value)
      + isolation                    = (known after apply)
      + kube_version                 = "4.3.5_openshift"
      + machine_type                 = "b3c.8x32"
      + name                         = "ROKS"
      + no_subnet                    = true
      + private_service_endpoint     = (known after apply)
      + private_service_endpoint_url = (known after apply)
      + private_vlan_id              = "2716994"
      + public_service_endpoint      = true
      + public_service_endpoint_url  = (known after apply)
      + public_vlan_id               = "2716992"
      + region                       = (known after apply)
      + resource_controller_url      = (known after apply)
      + resource_crn                 = (known after apply)
      + resource_group_id            = "ebf20540c1bc4ed485d936a4920cb563"
      + resource_group_name          = (known after apply)
      + resource_name                = (known after apply)
      + resource_status              = (known after apply)
      + server_url                   = (known after apply)
      + subnet_id                    = [
          + "2408754",
        ]
      + tags                         = (known after apply)
      + update_all_workers           = false
      + wait_time_minutes            = 90
      + worker_num                   = 0
      + worker_pools                 = (known after apply)

      + workers_info {
          + id        = (known after apply)
          + pool_name = (known after apply)
          + version   = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


Warning: "softlayer_username": [DEPRECATED] This field is deprecated please use iaas_classic_username



2020/04/17 14:06:09 [DEBUG] command: asking for input: "Do you want to perform these actions?"
Warning: "softlayer_api_key": [DEPRECATED] This field is deprecated please use iaas_classic_api_key



Warning: Interpolation-only expressions are deprecated

  on main.tf line 17, in resource "ibm_container_cluster" "RHOS":
  17:   resource_group_id       = "${data.ibm_resource_group.resource_group.id}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


Warning: Quoted references are deprecated

  on main.tf line 24, in data "ibm_container_cluster_config" "cluster_config":
  24:   depends_on        = ["ibm_container_cluster.RHOS"]

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

2020/04/17 14:08:28 [INFO] backend/local: apply calling Apply
2020/04/17 14:08:28 [INFO] terraform: building graph: GraphTypeApply
2020/04/17 14:08:28 [DEBUG] Resource state not found for node "ibm_container_cluster.RHOS", instance ibm_container_cluster.RHOS
2020/04/17 14:08:28 [DEBUG] Resource state not found for node "data.ibm_container_cluster_config.cluster_config", instance data.ibm_container_cluster_config.cluster_config
2020/04/17 14:08:28 [DEBUG] adding implicit provider configuration provider.ibm, implied first by ibm_container_cluster.RHOS
2020/04/17 14:08:28 [DEBUG] ProviderTransformer: "ibm_container_cluster.RHOS (prepare state)" (*terraform.NodeApplyableResource) needs provider.ibm
2020/04/17 14:08:28 [DEBUG] ProviderTransformer: "data.ibm_resource_group.resource_group (prepare state)" (*terraform.NodeApplyableResource) needs provider.ibm
2020/04/17 14:08:28 [DEBUG] ProviderTransformer: "data.ibm_container_cluster_config.cluster_config (prepare state)" (*terraform.NodeApplyableResource) needs provider.ibm
2020/04/17 14:08:28 [DEBUG] ProviderTransformer: "ibm_container_cluster.RHOS" (*terraform.NodeApplyableResourceInstance) needs provider.ibm
2020/04/17 14:08:28 [DEBUG] ProviderTransformer: "data.ibm_container_cluster_config.cluster_config" (*terraform.NodeApplyableResourceInstance) needs provider.ibm
2020/04/17 14:08:28 [DEBUG] ReferenceTransformer: "provider.ibm" references: []
2020/04/17 14:08:28 [DEBUG] ReferenceTransformer: "ibm_container_cluster.RHOS (prepare state)" references: []
2020/04/17 14:08:28 [DEBUG] ReferenceTransformer: "data.ibm_resource_group.resource_group (prepare state)" references: []
2020/04/17 14:08:28 [DEBUG] ReferenceTransformer: "data.ibm_container_cluster_config.cluster_config (prepare state)" references: []
2020/04/17 14:08:28 [DEBUG] ReferenceTransformer: "ibm_container_cluster.RHOS" references: [data.ibm_resource_group.resource_group (prepare state)]
2020/04/17 14:08:28 [DEBUG] ReferenceTransformer: "data.ibm_container_cluster_config.cluster_config" references: [ibm_container_cluster.RHOS (prepare state) ibm_container_cluster.RHOS ibm_container_cluster.RHOS data.ibm_resource_group.resource_group (prepare state) ibm_container_cluster.RHOS (prepare state) ibm_container_cluster.RHOS ibm_container_cluster.RHOS]
2020/04/17 14:08:28 [DEBUG] Starting graph walk: walkApply
2020-04-17T14:08:28.375+0530 [INFO]  plugin: configuring client automatic mTLS
2020-04-17T14:08:28.404+0530 [DEBUG] plugin: starting plugin: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6 args=[/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6]
2020-04-17T14:08:28.410+0530 [DEBUG] plugin: plugin started: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6 pid=57653
2020-04-17T14:08:28.410+0530 [DEBUG] plugin: waiting for RPC address: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6
2020-04-17T14:08:28.562+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:08:28 IBM Cloud Provider version 1.3.0  
2020-04-17T14:08:28.572+0530 [INFO]  plugin.terraform-provider-ibm_v1.2.6: configuring server automatic mTLS: timestamp=2020-04-17T14:08:28.572+0530
2020-04-17T14:08:28.609+0530 [DEBUG] plugin: using plugin: version=5
2020-04-17T14:08:28.609+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: plugin address: address=/var/folders/gc/bk1t73kn3qldrktw_9xqm3880000gn/T/plugin229780656 network=unix timestamp=2020-04-17T14:08:28.608+0530
2020-04-17T14:08:28.702+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:08:28 Configuring SoftLayer Session with API key
2020-04-17T14:08:28.702+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:08:28 Configuring IBM Cloud Session with API key
2020-04-17T14:08:35.224+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:08:35 the apiendpoint url for power is us-south.power-iaas.cloud.ibm.com
2020/04/17 14:08:35 [WARN] Provider "registry.terraform.io/-/ibm" produced an invalid plan for ibm_container_cluster.RHOS, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .wait_time_minutes: planned value cty.NumberIntVal(90) does not match config value cty.NullVal(cty.Number)
      - .update_all_workers: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .gateway_enabled: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .worker_num: planned value cty.NumberIntVal(0) does not match config value cty.NullVal(cty.Number)
      - .disk_encryption: planned value cty.True does not match config value cty.NullVal(cty.Bool)
      - .workers_info: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
ibm_container_cluster.RHOS: Creating...
2020/04/17 14:08:35 [DEBUG] ibm_container_cluster.RHOS: applying the planned Create change
2020-04-17T14:08:35.238+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:08:35 [DEBUG] setting computed for "tags" from ComputedKeys
2020-04-17T14:08:35.239+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:08:35 [DEBUG] setting computed for "worker_pools" from ComputedKeys
2020-04-17T14:08:35.239+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:08:35 [DEBUG] setting computed for "workers_info" from ComputedKeys
2020-04-17T14:08:35.239+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:08:35 [DEBUG] setting computed for "albs" from ComputedKeys
ibm_container_cluster.RHOS: Still creating... [10s elapsed]
2020-04-17T14:08:47.936+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:08:47 Waiting for cluster (bqcmm50d0avtq2t0mn80) to be available.
2020-04-17T14:08:47.936+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:08:47 [DEBUG] Waiting for state to become: [normal]
ibm_container_cluster.RHOS: Still creating... [20s elapsed]
2020-04-17T14:09:01.674+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:01 Total workers:  1
2020-04-17T14:09:01.674+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:01 Checking workers...
2020-04-17T14:09:01.674+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:01 Worker node status:  provision_pending
2020-04-17T14:09:01.674+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:01 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [30s elapsed]
2020-04-17T14:09:14.242+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:14 Total workers:  1
2020-04-17T14:09:14.242+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:14 Checking workers...
2020-04-17T14:09:14.242+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:14 Worker node status:  provision_pending
2020-04-17T14:09:14.242+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:14 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [40s elapsed]
ibm_container_cluster.RHOS: Still creating... [50s elapsed]
2020-04-17T14:09:26.455+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:26 Total workers:  1
2020-04-17T14:09:26.455+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:26 Checking workers...
2020-04-17T14:09:26.455+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:26 Worker node status:  provision_pending
2020-04-17T14:09:26.455+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:26 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [1m0s elapsed]
2020-04-17T14:09:38.337+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:38 Total workers:  1
2020-04-17T14:09:38.337+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:38 Checking workers...
2020-04-17T14:09:38.337+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:38 Worker node status:  provision_pending
2020-04-17T14:09:38.337+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:38 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [1m10s elapsed]
2020-04-17T14:09:51.053+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:51 Total workers:  1
2020-04-17T14:09:51.053+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:51 Checking workers...
2020-04-17T14:09:51.053+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:51 Worker node status:  provision_pending
2020-04-17T14:09:51.053+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:09:51 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [1m20s elapsed]
2020-04-17T14:10:04.447+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:04 Total workers:  1
2020-04-17T14:10:04.447+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:04 Checking workers...
2020-04-17T14:10:04.447+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:04 Worker node status:  provision_pending
2020-04-17T14:10:04.447+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:04 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [1m30s elapsed]
ibm_container_cluster.RHOS: Still creating... [1m40s elapsed]
2020-04-17T14:10:16.128+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:16 Total workers:  1
2020-04-17T14:10:16.129+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:16 Checking workers...
2020-04-17T14:10:16.129+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:16 Worker node status:  provision_pending
2020-04-17T14:10:16.129+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:16 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [1m50s elapsed]
2020-04-17T14:10:28.613+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:28 Total workers:  1
2020-04-17T14:10:28.613+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:28 Checking workers...
2020-04-17T14:10:28.613+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:28 Worker node status:  provision_pending
2020-04-17T14:10:28.613+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:28 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [2m0s elapsed]
2020-04-17T14:10:40.425+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:40 Total workers:  1
2020-04-17T14:10:40.426+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:40 Checking workers...
2020-04-17T14:10:40.426+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:40 Worker node status:  provision_pending
2020-04-17T14:10:40.426+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:40 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [2m10s elapsed]
2020-04-17T14:10:52.369+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:52 Total workers:  1
2020-04-17T14:10:52.369+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:52 Checking workers...
2020-04-17T14:10:52.369+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:52 Worker node status:  provision_pending
2020-04-17T14:10:52.369+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:10:52 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [2m20s elapsed]
2020-04-17T14:11:04.867+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:04 Total workers:  1
2020-04-17T14:11:04.867+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:04 Checking workers...
2020-04-17T14:11:04.867+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:04 Worker node status:  provision_pending
2020-04-17T14:11:04.867+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:04 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [2m30s elapsed]
ibm_container_cluster.RHOS: Still creating... [2m40s elapsed]
2020-04-17T14:11:17.350+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:17 Total workers:  1
2020-04-17T14:11:17.351+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:17 Checking workers...
2020-04-17T14:11:17.351+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:17 Worker node status:  provision_pending
2020-04-17T14:11:17.351+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:17 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [2m50s elapsed]
2020-04-17T14:11:29.086+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:29 Total workers:  1
2020-04-17T14:11:29.086+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:29 Checking workers...
2020-04-17T14:11:29.086+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:29 Worker node status:  provision_pending
2020-04-17T14:11:29.086+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:29 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [3m0s elapsed]
2020-04-17T14:11:41.333+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:41 Total workers:  1
2020-04-17T14:11:41.333+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:41 Checking workers...
2020-04-17T14:11:41.333+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:41 Worker node status:  provision_pending
2020-04-17T14:11:41.333+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:41 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [3m10s elapsed]
2020-04-17T14:11:54.732+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:54 Total workers:  1
2020-04-17T14:11:54.732+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:54 Checking workers...
2020-04-17T14:11:54.732+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:54 Worker node status:  provision_pending
2020-04-17T14:11:54.732+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:11:54 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [3m20s elapsed]
ibm_container_cluster.RHOS: Still creating... [3m30s elapsed]
2020-04-17T14:12:09.741+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:09 Total workers:  1
2020-04-17T14:12:09.741+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:09 Checking workers...
2020-04-17T14:12:09.741+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:09 Worker node status:  provision_pending
2020-04-17T14:12:09.741+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:09 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [3m40s elapsed]
2020-04-17T14:12:21.840+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:21 Total workers:  1
2020-04-17T14:12:21.841+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:21 Checking workers...
2020-04-17T14:12:21.841+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:21 Worker node status:  provision_pending
2020-04-17T14:12:21.841+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:21 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [3m50s elapsed]
2020-04-17T14:12:34.258+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:34 Total workers:  1
2020-04-17T14:12:34.258+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:34 Checking workers...
2020-04-17T14:12:34.258+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:34 Worker node status:  provision_pending
2020-04-17T14:12:34.258+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:34 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [4m0s elapsed]
ibm_container_cluster.RHOS: Still creating... [4m10s elapsed]
2020-04-17T14:12:46.083+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:46 Total workers:  1
2020-04-17T14:12:46.083+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:46 Checking workers...
2020-04-17T14:12:46.083+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:46 Worker node status:  provision_pending
2020-04-17T14:12:46.083+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:46 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [4m20s elapsed]
2020-04-17T14:12:58.449+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:58 Total workers:  1
2020-04-17T14:12:58.449+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:58 Checking workers...
2020-04-17T14:12:58.449+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:58 Worker node status:  provision_pending
2020-04-17T14:12:58.449+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:12:58 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [4m30s elapsed]
2020-04-17T14:13:10.407+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:13:10 Total workers:  1
2020-04-17T14:13:10.407+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:13:10 Checking workers...
2020-04-17T14:13:10.407+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:13:10 Worker node status:  provision_pending
2020-04-17T14:13:10.407+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:13:10 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [4m40s elapsed]
2020-04-17T14:13:23.025+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:13:23 Total workers:  1
2020-04-17T14:13:23.025+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:13:23 Checking workers...
2020-04-17T14:13:23.025+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:13:23 Worker node status:  provision_pending
2020-04-17T14:13:23.025+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:13:23 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [4m50s elapsed]
2020-04-17T14:13:35.138+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:13:35 Total workers:  1
2020-04-17T14:13:35.138+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:13:35 Checking workers...
2020-04-17T14:13:35.138+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:13:35 Worker node status:  provision_pending
2020-04-17T14:13:35.138+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:13:35 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [5m0s elapsed]
ibm_container_cluster.RHOS: Still creating... [5m10s elapsed]
2020-04-17T14:13:47.999+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:13:47 Total workers:  1
2020-04-17T14:13:47.999+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:13:47 Checking workers...
2020-04-17T14:13:47.999+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:13:47 Worker node status:  provision_pending
2020-04-17T14:13:47.999+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:13:47 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [5m20s elapsed]
2020-04-17T14:14:01.165+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:01 Total workers:  1
2020-04-17T14:14:01.165+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:01 Checking workers...
2020-04-17T14:14:01.165+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:01 Worker node status:  provision_pending
2020-04-17T14:14:01.165+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:01 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [5m30s elapsed]
2020-04-17T14:14:13.274+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:13 Total workers:  1
2020-04-17T14:14:13.274+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:13 Checking workers...
2020-04-17T14:14:13.274+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:13 Worker node status:  provision_pending
2020-04-17T14:14:13.274+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:13 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [5m40s elapsed]
ibm_container_cluster.RHOS: Still creating... [5m50s elapsed]
2020-04-17T14:14:25.746+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:25 Total workers:  1
2020-04-17T14:14:25.746+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:25 Checking workers...
2020-04-17T14:14:25.746+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:25 Worker node status:  provision_pending
2020-04-17T14:14:25.746+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:25 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [6m0s elapsed]
2020-04-17T14:14:39.196+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:39 Total workers:  1
2020-04-17T14:14:39.196+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:39 Checking workers...
2020-04-17T14:14:39.196+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:39 Worker node status:  provision_pending
2020-04-17T14:14:39.196+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:39 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [6m10s elapsed]
2020-04-17T14:14:51.121+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:51 Total workers:  1
2020-04-17T14:14:51.121+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:51 Checking workers...
2020-04-17T14:14:51.121+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:51 Worker node status:  provision_pending
2020-04-17T14:14:51.121+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:14:51 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [6m20s elapsed]
2020-04-17T14:15:03.828+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:03 Total workers:  1
2020-04-17T14:15:03.828+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:03 Checking workers...
2020-04-17T14:15:03.828+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:03 Worker node status:  provision_pending
2020-04-17T14:15:03.828+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:03 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [6m30s elapsed]
ibm_container_cluster.RHOS: Still creating... [6m40s elapsed]
2020-04-17T14:15:15.642+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:15 Total workers:  1
2020-04-17T14:15:15.642+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:15 Checking workers...
2020-04-17T14:15:15.642+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:15 Worker node status:  provision_pending
2020-04-17T14:15:15.642+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:15 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [6m50s elapsed]
2020-04-17T14:15:27.887+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:27 Total workers:  1
2020-04-17T14:15:27.887+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:27 Checking workers...
2020-04-17T14:15:27.887+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:27 Worker node status:  provision_pending
2020-04-17T14:15:27.887+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:27 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [7m0s elapsed]
2020-04-17T14:15:39.637+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:39 Total workers:  1
2020-04-17T14:15:39.637+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:39 Checking workers...
2020-04-17T14:15:39.637+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:39 Worker node status:  provision_pending
2020-04-17T14:15:39.637+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:39 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [7m10s elapsed]
2020-04-17T14:15:52.749+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:52 Total workers:  1
2020-04-17T14:15:52.749+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:52 Checking workers...
2020-04-17T14:15:52.749+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:52 Worker node status:  provision_pending
2020-04-17T14:15:52.749+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:15:52 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [7m20s elapsed]
ibm_container_cluster.RHOS: Still creating... [7m30s elapsed]
2020-04-17T14:16:09.243+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:16:09 Total workers:  1
2020-04-17T14:16:09.243+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:16:09 Checking workers...
2020-04-17T14:16:09.243+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:16:09 Worker node status:  provision_pending
2020-04-17T14:16:09.243+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:16:09 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [7m40s elapsed]
2020-04-17T14:16:22.553+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:16:22 Total workers:  1
2020-04-17T14:16:22.553+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:16:22 Checking workers...
2020-04-17T14:16:22.553+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:16:22 Worker node status:  provisioning
2020-04-17T14:16:22.553+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:16:22 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [7m50s elapsed]
2020-04-17T14:16:34.567+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:16:34 Total workers:  1
2020-04-17T14:16:34.567+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:16:34 Checking workers...
2020-04-17T14:16:34.567+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:16:34 Worker node status:  provisioning
2020-04-17T14:16:34.567+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:16:34 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [8m0s elapsed]
ibm_container_cluster.RHOS: Still creating... [8m10s elapsed]
2020-04-17T14:16:49.946+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:16:49 Total workers:  1
2020-04-17T14:16:49.946+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:16:49 Checking workers...
2020-04-17T14:16:49.946+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:16:49 Worker node status:  provisioning
2020-04-17T14:16:49.946+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:16:49 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [8m20s elapsed]
2020-04-17T14:17:02.252+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:02 Total workers:  1
2020-04-17T14:17:02.252+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:02 Checking workers...
2020-04-17T14:17:02.252+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:02 Worker node status:  provisioning
2020-04-17T14:17:02.252+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:02 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [8m30s elapsed]
2020-04-17T14:17:14.630+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:14 Total workers:  1
2020-04-17T14:17:14.630+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:14 Checking workers...
2020-04-17T14:17:14.630+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:14 Worker node status:  provisioning
2020-04-17T14:17:14.630+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:14 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [8m40s elapsed]
ibm_container_cluster.RHOS: Still creating... [8m50s elapsed]
2020-04-17T14:17:27.260+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:27 Total workers:  1
2020-04-17T14:17:27.260+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:27 Checking workers...
2020-04-17T14:17:27.260+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:27 Worker node status:  provisioning
2020-04-17T14:17:27.260+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:27 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [9m0s elapsed]
2020-04-17T14:17:39.344+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:39 Total workers:  1
2020-04-17T14:17:39.344+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:39 Checking workers...
2020-04-17T14:17:39.344+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:39 Worker node status:  provisioning
2020-04-17T14:17:39.344+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:39 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [9m10s elapsed]
2020-04-17T14:17:51.303+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:51 Total workers:  1
2020-04-17T14:17:51.303+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:51 Checking workers...
2020-04-17T14:17:51.303+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:51 Worker node status:  provisioning
2020-04-17T14:17:51.303+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:17:51 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [9m20s elapsed]
2020-04-17T14:18:04.483+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:18:04 Total workers:  1
2020-04-17T14:18:04.483+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:18:04 Checking workers...
2020-04-17T14:18:04.483+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:18:04 Worker node status:  provisioning
2020-04-17T14:18:04.483+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:18:04 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [9m30s elapsed]
ibm_container_cluster.RHOS: Still creating... [9m40s elapsed]
2020-04-17T14:18:17.782+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:18:17 Total workers:  1
2020-04-17T14:18:17.782+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:18:17 Checking workers...
2020-04-17T14:18:17.782+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:18:17 Worker node status:  provisioning
2020-04-17T14:18:17.782+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:18:17 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [9m50s elapsed]
ibm_container_cluster.RHOS: Still creating... [10m0s elapsed]
2020-04-17T14:18:36.081+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:18:36 Total workers:  1
2020-04-17T14:18:36.081+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:18:36 Checking workers...
2020-04-17T14:18:36.081+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:18:36 Worker node status:  provisioning
2020-04-17T14:18:36.081+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:18:36 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [10m10s elapsed]
2020-04-17T14:18:49.355+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:18:49 Total workers:  1
2020-04-17T14:18:49.356+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:18:49 Checking workers...
2020-04-17T14:18:49.356+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:18:49 Worker node status:  provisioning
2020-04-17T14:18:49.356+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:18:49 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [10m20s elapsed]
2020-04-17T14:19:03.608+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:03 Total workers:  1
2020-04-17T14:19:03.608+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:03 Checking workers...
2020-04-17T14:19:03.608+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:03 Worker node status:  provisioning
2020-04-17T14:19:03.608+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:03 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [10m30s elapsed]
ibm_container_cluster.RHOS: Still creating... [10m40s elapsed]
2020-04-17T14:19:16.249+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:16 Total workers:  1
2020-04-17T14:19:16.249+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:16 Checking workers...
2020-04-17T14:19:16.249+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:16 Worker node status:  provisioning
2020-04-17T14:19:16.249+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:16 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [10m50s elapsed]
2020-04-17T14:19:28.467+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:28 Total workers:  1
2020-04-17T14:19:28.467+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:28 Checking workers...
2020-04-17T14:19:28.467+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:28 Worker node status:  provisioning
2020-04-17T14:19:28.467+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:28 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [11m0s elapsed]
2020-04-17T14:19:40.463+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:40 Total workers:  1
2020-04-17T14:19:40.463+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:40 Checking workers...
2020-04-17T14:19:40.463+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:40 Worker node status:  provisioning
2020-04-17T14:19:40.463+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:40 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [11m11s elapsed]
2020-04-17T14:19:52.864+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:52 Total workers:  1
2020-04-17T14:19:52.864+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:52 Checking workers...
2020-04-17T14:19:52.864+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:52 Worker node status:  provisioning
2020-04-17T14:19:52.864+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:19:52 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [11m21s elapsed]
2020-04-17T14:20:05.109+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:05 Total workers:  1
2020-04-17T14:20:05.109+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:05 Checking workers...
2020-04-17T14:20:05.109+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:05 Worker node status:  provisioning
2020-04-17T14:20:05.109+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:05 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [11m31s elapsed]
ibm_container_cluster.RHOS: Still creating... [11m41s elapsed]
2020-04-17T14:20:16.700+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:16 Total workers:  1
2020-04-17T14:20:16.700+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:16 Checking workers...
2020-04-17T14:20:16.700+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:16 Worker node status:  provisioning
2020-04-17T14:20:16.700+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:16 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [11m51s elapsed]
2020-04-17T14:20:28.628+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:28 Total workers:  1
2020-04-17T14:20:28.628+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:28 Checking workers...
2020-04-17T14:20:28.628+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:28 Worker node status:  provisioning
2020-04-17T14:20:28.628+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:28 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [12m1s elapsed]
2020-04-17T14:20:40.570+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:40 Total workers:  1
2020-04-17T14:20:40.570+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:40 Checking workers...
2020-04-17T14:20:40.570+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:40 Worker node status:  provisioning
2020-04-17T14:20:40.570+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:40 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [12m11s elapsed]
2020-04-17T14:20:52.809+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:52 Total workers:  1
2020-04-17T14:20:52.809+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:52 Checking workers...
2020-04-17T14:20:52.809+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:52 Worker node status:  provisioning
2020-04-17T14:20:52.809+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:20:52 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [12m21s elapsed]
2020-04-17T14:21:05.167+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:05 Total workers:  1
2020-04-17T14:21:05.167+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:05 Checking workers...
2020-04-17T14:21:05.167+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:05 Worker node status:  provisioning
2020-04-17T14:21:05.167+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:05 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [12m31s elapsed]
ibm_container_cluster.RHOS: Still creating... [12m41s elapsed]
2020-04-17T14:21:17.320+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:17 Total workers:  1
2020-04-17T14:21:17.320+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:17 Checking workers...
2020-04-17T14:21:17.320+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:17 Worker node status:  provisioning
2020-04-17T14:21:17.320+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:17 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [12m51s elapsed]
2020-04-17T14:21:30.049+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:30 Total workers:  1
2020-04-17T14:21:30.049+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:30 Checking workers...
2020-04-17T14:21:30.049+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:30 Worker node status:  provisioning
2020-04-17T14:21:30.049+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:30 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [13m1s elapsed]
2020-04-17T14:21:41.967+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:41 Total workers:  1
2020-04-17T14:21:41.967+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:41 Checking workers...
2020-04-17T14:21:41.967+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:41 Worker node status:  provisioning
2020-04-17T14:21:41.967+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:41 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [13m11s elapsed]
2020-04-17T14:21:53.740+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:53 Total workers:  1
2020-04-17T14:21:53.740+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:53 Checking workers...
2020-04-17T14:21:53.740+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:53 Worker node status:  provisioning
2020-04-17T14:21:53.740+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:21:53 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [13m21s elapsed]
ibm_container_cluster.RHOS: Still creating... [13m31s elapsed]
2020-04-17T14:22:05.654+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:05 Total workers:  1
2020-04-17T14:22:05.654+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:05 Checking workers...
2020-04-17T14:22:05.654+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:05 Worker node status:  provisioning
2020-04-17T14:22:05.654+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:05 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [13m41s elapsed]
2020-04-17T14:22:17.328+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:17 Total workers:  1
2020-04-17T14:22:17.328+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:17 Checking workers...
2020-04-17T14:22:17.328+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:17 Worker node status:  provisioning
2020-04-17T14:22:17.328+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:17 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [13m51s elapsed]
2020-04-17T14:22:33.592+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:33 Total workers:  1
2020-04-17T14:22:33.592+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:33 Checking workers...
2020-04-17T14:22:33.592+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:33 Worker node status:  provisioning
2020-04-17T14:22:33.592+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:33 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [14m1s elapsed]
2020-04-17T14:22:45.168+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:45 Total workers:  1
2020-04-17T14:22:45.168+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:45 Checking workers...
2020-04-17T14:22:45.168+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:45 Worker node status:  deploying
2020-04-17T14:22:45.168+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:45 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [14m11s elapsed]
ibm_container_cluster.RHOS: Still creating... [14m21s elapsed]
2020-04-17T14:22:57.088+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:57 Total workers:  1
2020-04-17T14:22:57.088+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:57 Checking workers...
2020-04-17T14:22:57.088+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:57 Worker node status:  deploying
2020-04-17T14:22:57.088+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:22:57 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [14m31s elapsed]
2020-04-17T14:23:09.346+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:09 Total workers:  1
2020-04-17T14:23:09.346+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:09 Checking workers...
2020-04-17T14:23:09.346+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:09 Worker node status:  deploying
2020-04-17T14:23:09.346+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:09 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [14m41s elapsed]
2020-04-17T14:23:22.130+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:22 Total workers:  1
2020-04-17T14:23:22.130+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:22 Checking workers...
2020-04-17T14:23:22.130+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:22 Worker node status:  deploying
2020-04-17T14:23:22.130+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:22 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [14m51s elapsed]
2020-04-17T14:23:34.742+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:34 Total workers:  1
2020-04-17T14:23:34.742+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:34 Checking workers...
2020-04-17T14:23:34.742+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:34 Worker node status:  deploying
2020-04-17T14:23:34.742+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:34 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [15m1s elapsed]
ibm_container_cluster.RHOS: Still creating... [15m11s elapsed]
2020-04-17T14:23:46.253+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:46 Total workers:  1
2020-04-17T14:23:46.253+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:46 Checking workers...
2020-04-17T14:23:46.253+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:46 Worker node status:  deploying
2020-04-17T14:23:46.253+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:46 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [15m21s elapsed]
2020-04-17T14:23:58.396+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:58 Total workers:  1
2020-04-17T14:23:58.396+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:58 Checking workers...
2020-04-17T14:23:58.396+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:58 Worker node status:  deploying
2020-04-17T14:23:58.396+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:23:58 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [15m31s elapsed]
2020-04-17T14:24:11.402+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:11 Total workers:  1
2020-04-17T14:24:11.402+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:11 Checking workers...
2020-04-17T14:24:11.402+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:11 Worker node status:  deploying
2020-04-17T14:24:11.402+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:11 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [15m41s elapsed]
2020-04-17T14:24:23.352+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:23 Total workers:  1
2020-04-17T14:24:23.352+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:23 Checking workers...
2020-04-17T14:24:23.352+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:23 Worker node status:  deploying
2020-04-17T14:24:23.352+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:23 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [15m51s elapsed]
2020-04-17T14:24:35.566+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:35 Total workers:  1
2020-04-17T14:24:35.566+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:35 Checking workers...
2020-04-17T14:24:35.566+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:35 Worker node status:  deploying
2020-04-17T14:24:35.566+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:35 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [16m1s elapsed]
ibm_container_cluster.RHOS: Still creating... [16m11s elapsed]
2020-04-17T14:24:47.925+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:47 Total workers:  1
2020-04-17T14:24:47.925+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:47 Checking workers...
2020-04-17T14:24:47.925+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:47 Worker node status:  deploying
2020-04-17T14:24:47.925+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:47 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [16m21s elapsed]
2020-04-17T14:24:59.702+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:59 Total workers:  1
2020-04-17T14:24:59.702+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:59 Checking workers...
2020-04-17T14:24:59.702+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:59 Worker node status:  critical
2020-04-17T14:24:59.702+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:24:59 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [16m31s elapsed]
2020-04-17T14:25:11.407+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:25:11 Total workers:  1
2020-04-17T14:25:11.407+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:25:11 Checking workers...
2020-04-17T14:25:11.407+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:25:11 Worker node status:  critical
2020-04-17T14:25:11.407+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:25:11 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [16m41s elapsed]
2020-04-17T14:25:24.796+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:25:24 Total workers:  1
2020-04-17T14:25:24.796+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:25:24 Checking workers...
2020-04-17T14:25:24.796+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:25:24 Worker node status:  critical
2020-04-17T14:25:24.796+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:25:24 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [16m51s elapsed]
ibm_container_cluster.RHOS: Still creating... [17m1s elapsed]
2020-04-17T14:25:36.457+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:25:36 Total workers:  1
2020-04-17T14:25:36.457+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:25:36 Checking workers...
2020-04-17T14:25:36.457+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:25:36 Worker node status:  critical
2020-04-17T14:25:36.457+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:25:36 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [17m11s elapsed]
2020-04-17T14:25:48.375+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:25:48 Total workers:  1
2020-04-17T14:25:48.375+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:25:48 Checking workers...
2020-04-17T14:25:48.375+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:25:48 Worker node status:  normal
ibm_container_cluster.RHOS: Still creating... [17m21s elapsed]
ibm_container_cluster.RHOS: Still creating... [17m31s elapsed]
2020-04-17T14:26:08.115+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:26:08 Waiting for Ingress Subdomain and secret being assigned.
2020-04-17T14:26:08.115+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:26:08 [DEBUG] Waiting for state to become: [normal]
ibm_container_cluster.RHOS: Still creating... [17m41s elapsed]
2020-04-17T14:26:19.120+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:26:19 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [17m51s elapsed]
2020-04-17T14:26:30.157+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:26:30 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [18m1s elapsed]
2020-04-17T14:26:41.126+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:26:41 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [18m11s elapsed]
2020-04-17T14:26:52.120+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:26:52 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [18m21s elapsed]
2020-04-17T14:27:03.151+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:27:03 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [18m31s elapsed]
2020-04-17T14:27:14.186+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:27:14 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [18m41s elapsed]
2020-04-17T14:27:25.471+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:27:25 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [18m51s elapsed]
ibm_container_cluster.RHOS: Still creating... [19m1s elapsed]
2020-04-17T14:27:36.495+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:27:36 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [19m11s elapsed]
2020-04-17T14:27:47.458+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:27:47 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [19m21s elapsed]
2020-04-17T14:27:58.406+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:27:58 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [19m31s elapsed]
2020-04-17T14:28:09.409+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:28:09 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [19m41s elapsed]
2020-04-17T14:28:20.459+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:28:20 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [19m51s elapsed]
2020-04-17T14:28:31.735+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:28:31 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [20m1s elapsed]
2020-04-17T14:28:42.736+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:28:42 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [20m11s elapsed]
2020-04-17T14:28:53.695+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:28:53 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [20m21s elapsed]
2020-04-17T14:29:04.741+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:29:04 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [20m31s elapsed]
ibm_container_cluster.RHOS: Still creating... [20m41s elapsed]
2020-04-17T14:29:15.995+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:29:15 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [20m51s elapsed]
2020-04-17T14:29:26.995+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:29:26 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [21m1s elapsed]
2020-04-17T14:29:37.969+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:29:37 [TRACE] Waiting 10s before next try
ibm_container_cluster.RHOS: Still creating... [21m11s elapsed]
ibm_container_cluster.RHOS: Still creating... [21m21s elapsed]
ibm_container_cluster.RHOS: Still creating... [21m31s elapsed]
ibm_container_cluster.RHOS: Still creating... [21m41s elapsed]
ibm_container_cluster.RHOS: Still creating... [21m51s elapsed]
2020-04-17T14:30:26.127+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:30:26 tagList:  []
ibm_container_cluster.RHOS: Creation complete after 21m55s [id=bqcmm50d0avtq2t0mn80]
data.ibm_container_cluster_config.cluster_config: Refreshing state...
2020-04-17T14:30:46.474+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:30:46 Authentication failed. Trying token refresh
2020-04-17T14:30:47.908+0530 [DEBUG] plugin.terraform-provider-ibm_v1.2.6: 2020/04/17 14:30:47 Unknown service - No auth headers set
2020-04-17T14:30:51.839+0530 [DEBUG] plugin: plugin process exited: path=/Users/hkantare/.terraform.d/plugins/darwin_amd64/terraform-provider-ibm_v1.2.6 pid=57653
2020-04-17T14:30:51.839+0530 [DEBUG] plugin: plugin exited

Apply complete! Resources: 1 added, 0 changed, 0 destroyed
```